# UN Data Project

In [1]:
import pandas as pd   
import numpy as np 
import matplotlib.pyplot as plt  
import seaborn as sns

%matplotlib inline

### 5. - 6.

In [2]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv', nrows=6868)

In [3]:
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN

In [4]:
col_names = ['Country or Area','Year','Value','Value Footnotes']
internet_df = pd.read_csv('../data/internet_use.csv', names=col_names, skiprows=1, nrows=4495)

In [5]:
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

In [6]:
gdp_df.shape

(6868, 4)

In [7]:
internet_df.shape

(4495, 4)

#### Each df has 4 columns; gdp_df has 6868 rows, internet_df has 4495

In [8]:
type(gdp_df)

pandas.core.frame.DataFrame

In [9]:
type(internet_df)

pandas.core.frame.DataFrame

#### Both df's are pandas.core.frame.DataFrame types

In [10]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6858        Zimbabwe  1999  3600.849291              NaN
6859        Zimbabwe  1998  3653.920016              NaN
6860        Zimbabwe  1997  3580.048793              NaN
6861        Zimbabwe  1996  3520.430146              NaN
6862        Zimbabwe  1995  3226.413930              NaN
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

In [11]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

### 7.

In [12]:
gdp_df = gdp_df.drop(columns = 'Value Footnotes')

In [13]:
internet_df = internet_df.drop(columns = 'Value Footnotes')

### 8. - 9.

In [14]:
gdp_df.columns = ['Country','Year','GDP_Per_Capita']
gdp_df.head(2)

       Country  Year  GDP_Per_Capita
0  Afghanistan  2019     2065.036398
1  Afghanistan  2018     2033.779002

In [15]:
internet_df.columns = ['Country','Year','Internet_Users_Pct']
internet_df.head(2)

       Country  Year  Internet_Users_Pct
0  Afghanistan  2014                6.39
1  Afghanistan  2013                5.90

### 10. - 12.

In [16]:
gdp_and_internet_use = pd.merge(gdp_df, internet_df, how="outer", on=["Country","Year"])
gdp_and_internet_use.head(8)

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2019     2065.036398                 NaN
1  Afghanistan  2018     2033.779002                 NaN
2  Afghanistan  2017     2058.383832                 NaN
3  Afghanistan  2016     2057.062164                 NaN
4  Afghanistan  2015     2068.265904                 NaN
5  Afghanistan  2014     2102.385234            6.390000
6  Afghanistan  2013     2116.465454            5.900000
7  Afghanistan  2012     2075.491747            5.454545

In [28]:
gdp_and_internet_use.tail(10)

     Country  Year  GDP_Per_Capita  Internet_Users_Pct
7895   Yemen  2004             NaN            0.881223
7896   Yemen  2003             NaN            0.604734
7897   Yemen  2002             NaN            0.518796
7898   Yemen  2001             NaN            0.090802
7899   Yemen  2000             NaN            0.082500
7900   Yemen  1999             NaN            0.056629
7901   Yemen  1998             NaN            0.023323
7902   Yemen  1997             NaN            0.015025
7903   Yemen  1996             NaN            0.000621
7904   Yemen  1990             NaN            0.000000

### 13. - 14.

In [18]:
year_list = ['2004','2009','2014']
gdp_internet = gdp_and_internet_use.query("Year in @year_list")

In [19]:
gdp_internet

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
5               Afghanistan  2014     2102.385234            6.390000
10              Afghanistan  2009     1758.904043            3.550000
15              Afghanistan  2004     1200.278256            0.105809
23                  Albania  2014    11623.866679           60.100000
28                  Albania  2009    10346.864199           41.200000
...                     ...   ...             ...                 ...
7868  Virgin Islands (U.S.)  2009             NaN           27.396510
7873  Virgin Islands (U.S.)  2004             NaN           27.377009
7885                  Yemen  2014             NaN           22.550000
7890                  Yemen  2009             NaN            9.960000
7895                  Yemen  2004             NaN            0.881223

[830 rows x 4 columns]

In [20]:
gdp_internet_2004 = gdp_internet.query('Year == 2004')
gdp_internet_2009 = gdp_internet.query('Year == 2009')
gdp_internet_2014 = gdp_internet.query('Year == 2014')

In [21]:
gdp_internet_2014

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
5               Afghanistan  2014     2102.385234                6.39
23                  Albania  2014    11623.866679               60.10
53                  Algeria  2014    11512.705405               18.09
83                   Angola  2014     8239.828837               21.26
113     Antigua and Barbuda  2014    18104.241470               64.00
...                     ...   ...             ...                 ...
7761     T.F.Y.R. Macedonia  2014             NaN               68.06
7819              Venezuela  2014             NaN               57.00
7843               Viet Nam  2014             NaN               48.31
7863  Virgin Islands (U.S.)  2014             NaN               50.07
7885                  Yemen  2014             NaN               22.55

[277 rows x 4 columns]

### 15. - 17.

In [22]:
gdp_internet_2014.loc[gdp_internet_2014.Internet_Users_Pct.idxmax()]

Country               Iceland
Year                     2014
GDP_Per_Capita        49652.1
Internet_Users_Pct      98.16
Name: 2625, dtype: object

In [23]:
gdp_internet_2014.loc[gdp_internet_2014.Internet_Users_Pct.idxmin()]

Country               Dem. People's Rep. of Korea
Year                                         2014
GDP_Per_Capita                                NaN
Internet_Users_Pct                              0
Name: 7079, dtype: object

In [24]:
gdp_internet_2004.loc[gdp_internet_2004.Internet_Users_Pct.idxmax()]

Country               Sweden
Year                    2004
GDP_Per_Capita         44496
Internet_Users_Pct     83.89
Name: 6019, dtype: object

In [25]:
gdp_internet_2004.loc[gdp_internet_2004.Internet_Users_Pct.idxmin()]

Country               Dem. People's Rep. of Korea
Year                                         2004
GDP_Per_Capita                                NaN
Internet_Users_Pct                              0
Name: 7088, dtype: object

In [26]:
gdp_internet_2009.loc[gdp_internet_2009.Internet_Users_Pct.idxmax()]

Country               Iceland
Year                     2009
GDP_Per_Capita        48177.1
Internet_Users_Pct         93
Name: 2630, dtype: object

In [27]:
gdp_internet_2009.loc[gdp_internet_2009.Internet_Users_Pct.idxmin()]

Country               Dem. People's Rep. of Korea
Year                                         2009
GDP_Per_Capita                                NaN
Internet_Users_Pct                              0
Name: 7083, dtype: object